backend/controllers/image/ImageController.php

SELECT * FROM `project_files` WHERE `id`='12'
INSERT INTO `project_image` (`image_name`, `project_id`, `file_id`, `image_url`, `created_at`, `updated_at`) VALUES ('15817474997771.png', '4', 12, '/data/project4/hat/15817474997771.png', 1581747499, 1581747499)
---
    public function actionCreate(){
        $model = new ProjectImage();
        if ($model->load(Yii::$app->request->post())) {
            $files = UploadedFile::getInstances($model,'image_url');
            if($files) {
                foreach ($files as $file) {
                    $imageModel = new ProjectImage();
                    $fileModel = ProjectFiles::findOne($model->file_id);
                    $imageName = time() . rand(1000, 9999) . "." . $file->extension;
                    $path = Yii::$app->basePath . "/web/data/project" . $model->project_id . "/" . $fileModel->file_name . "/" . $imageName;
                    $file->saveAs($path);
                    $imageModel->image_name = $imageName;
                    $imageModel->project_id = $model->project_id;
                    $imageModel->file_id = $model->file_id;
                    $imageModel->image_url = "/data/project" . $model->project_id . "/" . $fileModel->file_name . "/" . $imageName;
                    $imageModel->save(false);

SELECT `id`, `file_name` AS `name` FROM `project_files` WHERE (`project_id`='4') AND (`status`=1)
---
    public function actionFile(){
        if (isset($_POST['depdrop_parents'])) {
            $ids = $_POST['depdrop_parents'];
            $level = empty($ids[0]) ? null : $ids[0];
            if ( $level != null) {
                $res = [];
                $data = ProjectFiles::find()->select(['id','file_name as name'])->andFilterWhere([
                    'project_id'=>$level,'status'=>1
                ])->asArray()->all();