backend/models/admin/Permission.php

   public static function takeMenuByAdmin(){
       $menu[ 'options'] = ['class' => 'sidebar-menu tree', 'data-widget'=> 'tree'];
       $menu[ 'items'][] =  ['label' => '管理系统首页',
           'icon'=>'home',
           'url' => \Yii::$app->homeUrl,
           //'options' => ['class' => 'header']
       ];
       $topMenu = self::find()->andFilterWhere(['status'=>self::$used_status])
                              ->andFilterWhere(['permission_level'=>1])->orderBy(['sort'=>SORT_ASC])->all();
       if($topMenu){
           foreach ($topMenu as $key=>$top) {
               $menu['items'][$key+2] =[
                   'label'=>$top->name,
                   'icon' => $top->icon?$top->icon:'calendar-check-o',
                   'url' => '#',
               ];
               $childItem = self::find()->andFilterWhere(['parent_id'=>$top->id])->andFilterWhere(['status'=>self::$used_status])
                                        ->andFilterWhere(['permission_level'=>2])->all();
---
SELECT * FROM `cnpo_permission` WHERE (`status`=1) AND (`permission_level`=1) ORDER BY `sort`
SELECT * FROM `cnpo_permission` WHERE (`parent_id`=47) AND (`status`=1) AND (`permission_level`=2)