backend/controllers/work/WorkController.php

SELECT * FROM `project` WHERE `status`=1
---
    public function actionIndex(){
        $userId = Yii::$app->user->id;
        if($userId==2){
            $project = Project::find()->andFilterWhere(['status'=>1])->all();

SELECT * FROM `project_files` WHERE (`project_id`='4') AND (`status`=1)
SELECT * FROM `project` WHERE `id`='4'
---
    public function actionFile($id){
        $files = ProjectFiles::find()->andFilterWhere([
            'project_id'=>$id,'status'=>1
        ])->asArray()->all();
        $project = Project::findOne($id);

SELECT COUNT(*) FROM `project_image` WHERE (`status`=1) AND (`file_id`='10')
SELECT * FROM `project_image` WHERE (`status`=1) AND (`file_id`='10') LIMIT 1
UPDATE `project_image` SET `status`=3, `updated_at`=1581747668 WHERE `id`='14'
---
    public function actionLabel($id){
        $imageNum = ProjectImage::find()->andFilterWhere([
            'status'=>1,'file_id'=>$id
        ])->count();
        if($imageNum<1){
            return $this->render('complete');
        }else{
            $image = ProjectImage::find()->andFilterWhere([
                'status'=>1,'file_id'=>$id
            ])->offset(rand(0,$imageNum-1))->limit(1)->one();
            $image->status = 3 ;
            $image->save(false);