backend/models/project/Project.php

    public static function takeProjectForSelect(){
        $result = self::find()->andFilterWhere(['status'=>1])
                        ->asArray()->all();
---
SELECT * FROM `project` WHERE `status`=1